In [2]:
import pandas as pd
# import datetime as dt

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[City of Stonnington] ProfileDataExport.csv')

In [ ]:
df.head()

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type', 'Unnamed: 10'], axis=1, inplace=True)

In [ ]:
df.head()

In [ ]:
df = df[df['Data label' ] == 'Usual Resident Population']

In [ ]:
df.head()

In [ ]:
df.drop(columns=['Data label'], axis = 1, inplace = True)

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Stonnington_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[City of Greater Bendigo] ProfileDataExport.csv')

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type', 'Unnamed: 10'], axis=1, inplace=True)

df = df[df['Data label' ] == 'Usual Resident Population']

df.drop(columns=['Data label'], axis = 1, inplace = True)

df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Bendigo_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[City of Darebin] ProfileDataExport.csv')

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type', 'Unnamed: 10'], axis=1, inplace=True)

df = df[df['Data label' ] == 'Usual Resident Population']

df.drop(columns=['Data label'], axis = 1, inplace = True)

df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Darebin_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/CaseyProfileDataExport.csv', encoding= 'unicode_escape')

In [ ]:
df.columns

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type'], axis=1, inplace=True)

df = df[df['Data label' ] == 'Usual Resident Population']

df.drop(columns=['Data label'], axis = 1, inplace = True)

df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Casey_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[Boroondara] ProfileDataExport_WeeklyIncome.csv')

In [ ]:
df.head()

In [ ]:
import pandas as pd

In [ ]:
vic_subs_popu_2019_df = pd.read_csv('c:/users/home/documents/project_3/static/data/VIC_ABS_ANNUAL_ERP_ASGS_2019.csv')

In [ ]:
vic_subs_popu_2019_df.drop(columns =['MEASURE', 'Measure', 'REGIONTYPE', 'Geography Level', 'ASGS_2016',
      'FREQUENCY', 'Frequency', 'TIME', 'Time', 'Flag Codes', 'Flags'], axis = 1, inplace=True)

In [ ]:
vic_subs_popu_2019_df.head()

In [ ]:
vic_subs_popu_2019_df['Region'] = vic_subs_popu_2019_df.Region.apply(lambda x: x.replace("- ", ""))

In [ ]:
# subs_df = vic_subs_popu_2019_df['Region']

In [ ]:
# vic_subs_popu_2019_df = vic_subs_popu_2019_df.Region.replace(" (Vic.)", "",regex=True)

In [ ]:
# vic_subs_popu_2019_df['Region'] = vic_subs_popu_2019_df['Region'].apply(lambda x: x[:x.find("(")])

In [ ]:
# vic_subs_popu_2019_df.head()

In [ ]:

# using regular expression module to clean the suburbs name

import re 
  
# Function to clean the names 
def Clean_names(Sub_name): 
    # Search for opening bracket in the name followed by 
    # any characters repeated any number of times 
    if re.search('\(.*', Sub_name): 
  
        # Extract the position of beginning of pattern 
        pos = re.search('\(.*', Sub_name).start() - 1
  
        # return the cleaned name 
        return Sub_name[:pos]
  
    else: 
        # if clean up needed return the same name 
        return Sub_name

In [ ]:
# Updated the city columns 

vic_subs_popu_2019_df['Region'] = vic_subs_popu_2019_df['Region'].apply(Clean_names)


# Print the updated dataframe 
# print(vic_subs_popu_2019_df)

In [ ]:
#vic_subs_popu_2019_df.to_csv('c:/users/home/documents/project_3/static/data/Vic_Subs_Popu_2019.csv', index= False)

In [ ]:
# vic_subs_popu_2019_df.head()

In [ ]:
# cleaning median household income data

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/[Boroondara] median-household-income.xls', header=2)

In [ ]:
df = df[0:len(df)-7]

In [ ]:
df = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income' })

In [ ]:
df

In [ ]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/[Stonnington] median-household-income.xls', header=2)

In [ ]:
df = df[0:len(df)-6]
df = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income' })
df

In [ ]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/[City of Yarra] median-household-income.xls', header=2)
#df

In [ ]:
df = df[0:len(df)-7]
df2 = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income' })
df2

In [ ]:
frames = [df, df2]
df = pd.concat(frames, ignore_index=True, sort=False)

In [ ]:
df

In [ ]:
df.columns

In [ ]:
len(lga_list)

In [80]:
import pandas as pd

In [81]:
# create a list of lga
lga_list = ['[Banyule]', '[Bendigo]', '[Boroondara]', '[City of Ballarat]', 
           '[City of Yarra]', '[Colac]', '[Darebin]', '[East Gippsland]', 
            '[Eastern Region]', '[Frankston]', '[Geelong]', '[Gippsland]',
           '[Glen Eira]', '[Grampians Shire]', '[Hobsons Bay]', 
           '[Hume City]', '[Kingston]', '[Knox]', '[Macedon]', 
            '[Manningham]', '[Maribyrnong]', '[Maroondah]', '[Melton]',
           '[Mitchell Shire Council]', '[Monash]', '[Moorabool Shire]',
           '[Moreland]', '[Mornington]', '[Port Phillip]', '[Shepparton]',
           '[South Gippsland Shire]', '[Wangaratta]', '[Warrnambool]', 
            '[Wellington Shire]', '[Whitehorse]', '[Whittlesea]', '[Wodonga]',
           '[Wyndham]', '[Yarra Ranges]']

In [217]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/median-household-income/[Banyule] median-household-income.xls', header=2)
df = df[0:len(df)-7] # slice to remove unused rows
df = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income'})

for i in range(1, len(lga_list)):

    # read excel file

    df1 = pd.read_excel(f'c:/users/home/documents/project_3/static/data/median-household-income/{lga_list[i]} median-household-income.xls', header=2)

    df1 = df1[0:len(df1)-7] # slice to remove unused rows

    # rename columns
    df1 = df1.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income'})


    # append to dataframe
    df = df.append(df1, ignore_index=True, sort=False)

In [222]:
type(df)

pandas.core.frame.DataFrame

In [223]:
test_df = df.copy()

In [226]:
df['Suburb'] = df['Suburb'].apply(lambda x: x.split(" -"))
df['Suburb'] = df['Suburb'].apply(lambda x: x[0])
df.head()

          Suburb  Median Income
0     Briar Hill         1604.0
1       Bundoora         1363.0
2      Eaglemont         2352.0
3  Greensborough         1634.0
4     Heidelberg         1735.0

In [230]:
import re 
  
# Function to clean the names 
def Clean_names(Sub_name): 
    # Search for opening bracket in the name followed by 
    # any characters repeated any number of times 
    if re.search('\(.*', Sub_name): 
  
        # Extract the position of beginning of pattern 
        pos = re.search('\(.*', Sub_name).start() - 1
  
        # return the cleaned name 
        return Sub_name[:pos]
  
    else: 
        # if clean up needed return the same name 
        return Sub_name

In [231]:
df['Suburb'] = df['Suburb'].apply(Clean_names)

In [232]:
df.to_csv("c:/users/home/documents/project_3/static/data/Median_Income.csv", index=False)

In [1]:
# load real estate data
import pandas as pd

In [7]:
df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/MELBOURNE_HOUSE_PRICES_LESS.csv")

In [8]:
df.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Postcode', 'Regionname', 'Propertycount', 'Distance',
       'CouncilArea'],
      dtype='object')

In [9]:
del_cols = ['Regionname', 'Propertycount', 'Distance']

In [10]:
df.drop(columns=del_cols, inplace=True)

In [22]:
df.tail()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Postcode,CouncilArea
63018,Roxburgh Park,3 Carr Pl,3,h,566000.0,S,Raine,31/03/2018,3064,Hume City Council
63019,Roxburgh Park,9 Parker Ct,3,h,500000.0,S,Raine,31/03/2018,3064,Hume City Council
63020,Roxburgh Park,5 Parkinson Wy,3,h,545000.0,S,Raine,31/03/2018,3064,Hume City Council
63021,Thomastown,3/1 Travers St,3,u,NaN,PI,Barry,31/03/2018,3074,Whittlesea City Council
63022,Williams Landing,1 Diadem Wy,4,h,NaN,SP,Aussie,31/03/2018,3027,Wyndham City Council

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62353 entries, 670 to 63022
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Suburb       62353 non-null  object
 1   Address      62353 non-null  object
 2   Rooms        62353 non-null  int64
 3   Type         62353 non-null  object
 4   Price        47910 non-null  float64
 5   Method       62353 non-null  object
 6   SellerG      62353 non-null  object
 7   Date         62353 non-null  object
 8   Postcode     62353 non-null  int64
 9   CouncilArea  62353 non-null  object
dtypes: float64(1), int64(2), object(7)
memory usage: 5.2+ MB

In [31]:
df = df[:100]

In [34]:
df.shape

(100, 10)

In [35]:
#df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_House_Price.html", index=False)

In [44]:
df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/dv279-schoollocations2019.csv")

In [37]:
df.shape

(2254, 21)

In [38]:
df.columns

Index(['Education_Sector', 'Entity_Type', 'School_No', 'School_Name',
       'School_Type', 'School_Status', 'Address_Line_1', 'Address_Line_2',
       'Address_Town', 'Address_State', 'Address_Postcode',
       'Postal_Address_Line_1', 'Postal_Address_Line_2', 'Postal_Town',
       'Postal_State', 'Postal_Postcode', 'Full_Phone_No', 'LGA_ID',
       'LGA_Name', 'X', 'Y'],
      dtype='object')

In [45]:
del_cols = ['Education_Sector', 'Entity_Type','Entity_Type', 'School_No',
            'School_Status',  'Address_Line_2', 'Address_Town', 'Address_State', 
            'Postal_Address_Line_1', 'Postal_Address_Line_2', 'Postal_Town', 
            'Postal_State', 'Postal_Postcode', 'LGA_ID', 'X', 'Y']

In [46]:
df.drop(columns=del_cols, inplace=True)

In [47]:
df.head()

,School_Name,School_Type,Address_Line_1,Address_Postcode,Full_Phone_No,LGA_Name
0,Alberton Primary School,Primary,21 Thomson Street,3971,03 5183 2412,Wellington (S)
1,Allansford and District Primary School,Primary,Frank Street,3277,03 5565 1382,Warrnambool (C)
2,Avoca Primary School,Primary,118 Barnett Street,3467,03 5465 3176,Pyrenees (S)
3,Avenel Primary School,Primary,40 Anderson Street,3664,03 5796 2264,Strathbogie (S)
4,Warrandyte Primary School,Primary,5-11 Forbes Street,3113,03 9844 3537,Manningham (C)

In [50]:
df = df.rename(columns={'School_Name': 'School Name', 'School_Type': 'School Type', 
                        'Address_Line_1': 'Address', 'Address_Postcode':'Postcode',
                       'Full_Phone_No': 'Phone #', 'LGA_Name':'LGA Name'})

In [51]:
df.head()

,School Name,School Type,Address,Postcode,Phone #,LGA Name
0,Alberton Primary School,Primary,21 Thomson Street,3971,03 5183 2412,Wellington (S)
1,Allansford and District Primary School,Primary,Frank Street,3277,03 5565 1382,Warrnambool (C)
2,Avoca Primary School,Primary,118 Barnett Street,3467,03 5465 3176,Pyrenees (S)
3,Avenel Primary School,Primary,40 Anderson Street,3664,03 5796 2264,Strathbogie (S)
4,Warrandyte Primary School,Primary,5-11 Forbes Street,3113,03 9844 3537,Manningham (C)

In [52]:
df.to_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_Schools.csv", index=False)

df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_Schools.html", index=False)

In [55]:
# loading population data

df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/VIC_ABS_ANNUAL_ERP_ASGS2001_2019.csv")

In [57]:
df.shape

(17062, 13)

In [58]:
df.columns

Index(['MEASURE', 'Measure', 'REGIONTYPE', 'Geography Level', 'ASGS_2016',
       'Region', 'FREQUENCY', 'Frequency', 'TIME', 'Time', 'Value',
       'Flag Codes', 'Flags'],
      dtype='object')

In [59]:
del_cols = ['MEASURE', 'Measure', 'REGIONTYPE', 'Geography Level', 'ASGS_2016',
            'FREQUENCY', 'Frequency', 'TIME', 'Flag Codes', 'Flags']

In [60]:
df.drop(columns=del_cols, inplace=True)

In [62]:
df = df.rename(columns={'Region':'Suburb', 'Time':'Year'})

In [126]:
df.shape

(17062, 3)

In [63]:
df.head()

      Suburb  Year  Value
0  Brunswick  2001  20661
1  Brunswick  2002  20906
2  Brunswick  2003  21015
3  Brunswick  2004  21147
4  Brunswick  2005  21384

In [193]:
# reverse table to col-row

sub_df = df.pivot_table(index=['Suburb'], columns='Year',
                     values='Value', aggfunc='first').reset_index()

In [177]:
#sub_df.info()

In [178]:
sub_df.dropna(how='any', axis=0, inplace=True)

In [170]:
sub_df.describe()

Year,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000
mean,8961.835189,9053.270601,9152.161470,9249.358575,9363.307350,9499.008909,9679.680401,9884.732739,10109.772829,10283.038976,10449.623608,10671.886414,10889.513363,11073.603563,11253.802895,11450.945434,11649.007795,11842.150334,12038.587973
std,5685.827975,5679.815471,5673.242362,5679.373213,5699.081274,5742.094155,5819.899502,5921.744738,6041.857541,6139.257277,6237.572193,6381.161428,6541.223751,6699.386238,6868.804000,7076.149218,7303.173609,7534.487080,7776.912091
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,4589.500000,4665.500000,4678.250000,4759.750000,4826.250000,4953.000000,5010.500000,5171.000000,5331.500000,5457.750000,5511.750000,5592.250000,5648.250000,5717.000000,5803.500000,5920.000000,5979.750000,6042.250000,6091.250000
50%,8068.500000,8126.500000,8331.000000,8485.500000,8521.000000,8616.500000,8885.000000,9133.000000,9290.000000,9465.000000,9679.000000,9945.000000,10098.000000,10289.500000,10433.000000,10539.500000,10722.000000,10821.000000,10973.500000
75%,12846.500000,12993.000000,13073.000000,13192.750000,13487.000000,13634.000000,13917.500000,14052.500000,14276.250000,14577.500000,14773.000000,14919.000000,15236.000000,15418.500000,15779.000000,16038.500000,16366.250000,16608.000000,16815.500000
max,26445.000000,26384.000000,26263.000000,26062.000000,25768.000000,25883.000000,26313.000000,26774.000000,27312.000000,27583.000000,27978.000000,29910.000000,31504.000000,33626.000000,37162.000000,40181.000000,45327.000000,49247.000000,51894.000000

In [194]:
sub_df = sub_df[sub_df[2001] != 0]

In [195]:
sub_df.describe()

Year,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000
mean,9250.262069,9344.640230,9446.713793,9547.039080,9664.655172,9804.724138,9991.187356,10202.728736,10434.801149,10613.495402,10785.240230,11014.198851,11238.383908,11428.006897,11613.516092,11816.490805,12020.490805,12219.463218,12421.865517
std,5540.686292,5529.365576,5516.971844,5518.091866,5532.655251,5570.737833,5643.306626,5740.217670,5855.604677,5949.657612,6045.156193,6186.095891,6344.785164,6503.221267,6673.916108,6883.873051,7114.389665,7349.477250,7595.937575
min,3.000000,3.000000,4.000000,5.000000,5.000000,3.000000,4.000000,6.000000,7.000000,9.000000,9.000000,9.000000,7.000000,6.000000,4.000000,3.000000,3.000000,3.000000,3.000000
25%,4836.000000,4894.000000,5007.250000,5140.750000,5199.000000,5283.750000,5349.500000,5466.500000,5690.250000,5711.750000,5841.250000,6015.500000,6073.250000,6103.000000,6194.500000,6290.500000,6312.750000,6409.250000,6457.500000
50%,8311.500000,8441.500000,8643.500000,8782.500000,8930.500000,9012.500000,9187.500000,9465.000000,9657.500000,9836.000000,10012.500000,10067.500000,10342.500000,10490.500000,10731.500000,10803.500000,10916.000000,11027.000000,11161.500000
75%,12947.000000,13109.250000,13170.750000,13412.750000,13585.750000,13795.750000,13983.250000,14204.000000,14346.000000,14741.500000,14949.250000,15117.000000,15701.750000,15834.750000,16008.250000,16377.250000,16622.250000,16809.000000,17096.000000
max,26445.000000,26384.000000,26263.000000,26062.000000,25768.000000,25883.000000,26313.000000,26774.000000,27312.000000,27583.000000,27978.000000,29910.000000,31504.000000,33626.000000,37162.000000,40181.000000,45327.000000,49247.000000,51894.000000

In [202]:
# sub_df['Suburb'] = sub_df['Suburb'].apply(lambda x: x.split(" -"))
# sub_df['Suburb'] = sub_df['Suburb'].apply(lambda x: x[0])
sub_df = sub_df[1:]
sub_df.head()

,Suburb,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
1,Abbotsford,4150,4339,4444,4452,4498,4537,4638,4727,4833,5029,5213,5544,6539,7411,8078,8770,9453,9855,10088
2,Aberfoyle Park,12307,12377,12433,12385,12415,12454,12414,12356,12251,12207,12146,12126,12063,12035,11960,11863,11835,11784,11723
3,Airport West,6997,6970,6952,6904,6870,6878,6920,6983,7067,7175,7234,7301,7390,7521,7694,7903,8032,8280,8559
4,Albany,13971,14019,14047,14088,14173,14218,14230,14254,14274,14298,14324,14503,14630,14635,14663,14622,14490,14402,14286
5,Albany Region,2805,2816,2837,2854,2891,2929,2941,2964,3010,3039,3082,3155,3258,3364,3439,3501,3561,3620,3685

In [203]:
# sub_df.to_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2001_2019.csv", index=False)

In [204]:
sub_df=pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2001_2019.csv")

In [205]:
# sub_df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2001_2019.html")

In [206]:
sub_df.columns

Index(['Suburb', '2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016',
       '2017', '2018', '2019'],
      dtype='object')

In [207]:
sub_df.drop(columns=['2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008'], axis=1, inplace=True)

In [208]:
sub_df.head()

,Suburb,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Abbotsford,4833,5029,5213,5544,6539,7411,8078,8770,9453,9855,10088
1,Aberfoyle Park,12251,12207,12146,12126,12063,12035,11960,11863,11835,11784,11723
2,Airport West,7067,7175,7234,7301,7390,7521,7694,7903,8032,8280,8559
3,Albany,14274,14298,14324,14503,14630,14635,14663,14622,14490,14402,14286
4,Albany Region,3010,3039,3082,3155,3258,3364,3439,3501,3561,3620,3685

In [209]:
sub_df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2009_2019.html")

In [166]:
#cleaned_df.to_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Popu_2001_2019.csv", index=False)

In [3]:
# loading melbourne house data
df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_House_Full.csv")

Features of the Melbourne House Price Data:

Suburb: An outlying district of a city
Address: Address of the property.
Rooms: Number of rooms
Method: S - property sold; SP - property sold prior; PI - property passed in; PN - sold prior not disclosed; SN - sold not disclosed; NB - no bid; VB - vendor bid; W - withdrawn prior to auction; SA - sold after auction; SS - sold after auction price not disclosed. N/A - price or highest bid not available.
Type: h - house,cottage,villa, semi,terrace; u - unit, duplex; t - townhouse;
SellerG: Real Estate Agent
Date: Date sold
Distance: Distance from CBD(Central Business District)
Regionname: General Region (West, North West, North, North east ...etc)
Propertycount: Number of properties that exist in the suburb.
Bedroom2 : Scraped # of Bedrooms (from different source)
Bathroom: Number of Bathrooms
Car: Number of carspots
Landsize: Land Size
BuildingArea: Building Size
YearBuilt: Year the house was built
CouncilArea: Governing council for the area
Lattitude: Self explanatory
Longtitude: Self explanatory

In [5]:
# having a look at the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34857 entries, 0 to 34856
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         34857 non-null  object
 1   Address        34857 non-null  object
 2   Rooms          34857 non-null  int64
 3   Type           34857 non-null  object
 4   Price          27247 non-null  float64
 5   Method         34857 non-null  object
 6   SellerG        34857 non-null  object
 7   Date           34857 non-null  object
 8   Distance       34856 non-null  float64
 9   Postcode       34856 non-null  float64
 10  Bedroom2       26640 non-null  float64
 11  Bathroom       26631 non-null  float64
 12  Car            26129 non-null  float64
 13  Landsize       23047 non-null  float64
 14  BuildingArea   13742 non-null  float64
 15  YearBuilt      15551 non-null  float64
 16  CouncilArea    34854 non-null  object
 17  Lattitude      26881 non-null  float64
 18  Longtitude     26881 non-null  float64
 19  Regionname     34854 non-null  object
 20  Propertycount  34854 non-null  float64
dtypes: float64(12), int64(1), object(8)
memory usage: 5.6+ MB

In [6]:
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

import seaborn as sns

In [11]:
#Plotly
import plotly.express as px
import plotly.graph_objs as go

In [13]:
#Some styling
sns.set_style("whitegrid")
plt.style.use("fivethirtyeight")

import plotly.io as pio
pio.templates.default = 'presentation'

#Subplots
from plotly.subplots import make_subplots


#Showing full path of datasets
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))
        
# Disable warnings 
import warnings
warnings.filterwarnings('ignore')

In [10]:
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,NaN,SS,Jellis,3/09/2016,2.5,3067.0,...,1.0,1.0,126.0,NaN,NaN,Yarra City Council,-37.8014,144.9958,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra City Council,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra City Council,-37.8079,144.9934,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,NaN,VB,Rounds,4/02/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra City Council,-37.8114,145.0116,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra City Council,-37.8093,144.9944,Northern Metropolitan,4019.0

Collecting plotly
  Downloading plotly-4.14.3-py2.py3-none-any.whl (13.2 MB)
Collecting retrying>=1.3.3
  Downloading retrying-1.3.3.tar.gz (10 kB)
Requirement already satisfied: six in c:\users\home\.conda\envs\pythondata\lib\site-packages (from plotly) (1.15.0)
Building wheels for collected packages: retrying
  Building wheel for retrying (setup.py): started
  Building wheel for retrying (setup.py): finished with status 'done'
  Created wheel for retrying: filename=retrying-1.3.3-py3-none-any.whl size=11429 sha256=0fd69d65d2547ad4b28056ac84f1afef169ff68530b1eedea99c332985ed605c
  Stored in directory: c:\users\home\appdata\local\pip\cache\wheels\ac\cb\8a\b27bf6323e2f4c462dcbf77d70b7c5e7868a7fbe12871770cf
Successfully built retrying
Installing collected packages: retrying, plotly
Successfully installed plotly-4.14.3 retrying-1.3.3

In [14]:
df.shape

(34857, 21)

In [15]:
df.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount'],
      dtype='object')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34857 entries, 0 to 34856
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         34857 non-null  object
 1   Address        34857 non-null  object
 2   Rooms          34857 non-null  int64
 3   Type           34857 non-null  object
 4   Price          27247 non-null  float64
 5   Method         34857 non-null  object
 6   SellerG        34857 non-null  object
 7   Date           34857 non-null  object
 8   Distance       34856 non-null  float64
 9   Postcode       34856 non-null  float64
 10  Bedroom2       26640 non-null  float64
 11  Bathroom       26631 non-null  float64
 12  Car            26129 non-null  float64
 13  Landsize       23047 non-null  float64
 14  BuildingArea   13742 non-null  float64
 15  YearBuilt      15551 non-null  float64
 16  CouncilArea    34854 non-null  object
 17  Lattitude      26881 non-null  float64
 18  Longtitude     26881 non-null  float64
 19  Regionname     34854 non-null  object
 20  Propertycount  34854 non-null  float64
dtypes: float64(12), int64(1), object(8)
memory usage: 5.6+ MB

In [18]:
df.describe()

,Rooms,Price,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,Lattitude,Longtitude,Propertycount
count,34857.000000,2.724700e+04,34856.000000,34856.000000,26640.000000,26631.000000,26129.000000,23047.000000,13742.00000,15551.000000,26881.000000,26881.000000,34854.000000
mean,3.031012,1.050173e+06,11.184929,3116.062859,3.084647,1.624798,1.728845,593.598993,160.25640,1965.289885,-37.810634,145.001851,7572.888306
std,0.969933,6.414671e+05,6.788892,109.023903,0.980690,0.724212,1.010771,3398.841946,401.26706,37.328178,0.090279,0.120169,4428.090313
min,1.000000,8.500000e+04,0.000000,3000.000000,0.000000,0.000000,0.000000,0.000000,0.00000,1196.000000,-38.190430,144.423790,83.000000
25%,2.000000,6.350000e+05,6.400000,3051.000000,2.000000,1.000000,1.000000,224.000000,102.00000,1940.000000,-37.862950,144.933500,4385.000000
50%,3.000000,8.700000e+05,10.300000,3103.000000,3.000000,2.000000,2.000000,521.000000,136.00000,1970.000000,-37.807600,145.007800,6763.000000
75%,4.000000,1.295000e+06,14.000000,3156.000000,4.000000,2.000000,2.000000,670.000000,188.00000,2000.000000,-37.754100,145.071900,10412.000000
max,16.000000,1.120000e+07,48.100000,3978.000000,30.000000,12.000000,26.000000,433014.000000,44515.00000,2106.000000,-37.390200,145.526350,21650.000000

In [19]:
df.skew()

Rooms             0.499097
Price             2.588969
Distance          1.503586
Postcode          4.018786
Bedroom2          1.406366
Bathroom          1.356293
Car               2.095176
Landsize         96.022311
BuildingArea     99.132579
YearBuilt        -1.080913
Lattitude        -0.257661
Longtitude       -0.394880
Propertycount     0.992100
dtype: float64

In [25]:
# check if there is missing values
df.isna().sum()

Suburb               0
Address              0
Rooms                0
Type                 0
Price             7610
Method               0
SellerG              0
Date                 0
Distance             1
Postcode             1
Bedroom2          8217
Bathroom          8226
Car               8728
Landsize         11810
BuildingArea     21115
YearBuilt        19306
CouncilArea          3
Lattitude         7976
Longtitude        7976
Regionname           3
Propertycount        3
dtype: int64

In [26]:
df['Car'].isna().sum()

8728

In [27]:
df.Car.median()

2.0

In [28]:
df.Car.value_counts()

2.0     12214
1.0      9164
0.0      1631
3.0      1606
4.0      1161
5.0       151
6.0       140
7.0        25
8.0        23
10.0        6
9.0         3
11.0        2
26.0        1
12.0        1
18.0        1
Name: Car, dtype: int64

In [ ]:
df.drop(columns=['BuildingArea'],axis=1,inplace=True)